/*
 * DoIt.c
 *
 *  Created on: Oct 25, 2021
 *      Author: rura
 */
#include <stdbool.h>
#include "Technology.h"
/*****************************************
Исполнитель планов координации
Получаем сверху план координации для исполнения
При переходе получаем новый план и схему перехода
Всегда по запросу отдаем график исполнения на ближайшие циклы
от текущего времени
При этом всегда ТВП с замещающими фазами и МГР правильный

******************************************/

void DoIt(){
	while(true){

	}
}

